Revit 2027 API
BuiltInFailures.RebarFailures.StandardHookBendDiameterTooSmall Property
 Rebar Standard Hook Bend Diameter is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StandardHookBendDiameterTooSmall { get; }
Public Shared ReadOnly Property StandardHookBendDiameterTooSmall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StandardHookBendDiameterTooSmall {
	FailureDefinitionId^ get ();
}
static member StandardHookBendDiameterTooSmall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace